# Taps
tap "azure/functions"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "isen-ng/dotnet-sdk-versions"
tap "planetscale/tap"
tap "romkatv/powerlevel10k"
tap "supabase/tap"

# Binaries
brew "webp"
brew "python@3.10"
brew "azure-cli"
brew "bat"
brew "glib"
brew "harfbuzz"
brew "binwalk"
brew "broot"
brew "cocoapods"
brew "exa"
brew "unbound"
brew "gnutls"
brew "srt"
brew "ffmpeg"
brew "git"
brew "git-delta"
brew "gobject-introspection"
brew "gping"
brew "libfido2"
brew "mysql-client"
brew "neofetch"
brew "node"
brew "nvm"
brew "pnpm"
brew "procs"
brew "pure"
brew "qrencode"
brew "ripgrep"
brew "tmux"
brew "vercel-cli"
brew "watch"
brew "yarn"
brew "yt-dlp"
brew "zsh"
brew "azure/functions/azure-functions-core-tools@3"
brew "planetscale/tap/pscale"
brew "romkatv/powerlevel10k/powerlevel10k"
brew "supabase/tap/supabase"

# Casks
cask '1password'
cask 'caffeine'
cask "arc"
cask "azure-data-studio"
cask "browserstacklocal"
cask "datagrip"
cask "discord"
cask "dotnet-sdk"
cask "dotnet-sdk6-0-400"
cask "figma"
cask "firefox-developer-edition"
cask "framer"
cask "google-chrome"
cask "imageoptim"
cask "jetbrains-toolbox"
cask "kap"
cask "keycastr"
cask "koala"
cask "microsoft-auto-update"
cask "microsoft-azure-storage-explorer"
cask "microsoft-edge"
cask "mullvadvpn"
cask "notion"
cask "postman"
cask "raycast"
cask "rider"
cask "sensei"
cask "signal"
cask "slack"
cask "spotify"
cask "stats"
cask "teamviewer"
cask "the-unarchiver"
cask "visual-studio-code"
cask "webstorm"
cask "wireshark"
cask "zoom"
