tap "anomalyco/tap"
tap "azure/functions"
tap "homebrew/bundle"
tap "homebrew/services"
tap "libsql/sqld"
tap "opencode-ai/tap"
tap "oven-sh/bun"
tap "planetscale/tap"
tap "romkatv/powerlevel10k"
tap "supabase/tap"
tap "tursodatabase/tap"

brew "azure-cli"
brew "bat"
brew "binwalk"
brew "broot"
brew "cocoapods"
brew "docker-compose"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fastfetch"
brew "fnm"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "gping"
brew "graphviz"
brew "httpstat"
brew "jq"
brew "loc"
brew "mas"
brew "meilisearch"
brew "mysql-client"
brew "neovim"
brew "ollama"
brew "pnpm"
brew "powerlevel10k"
brew "procs"
brew "q"
brew "qrencode"
brew "ripgrep"
brew "television"
brew "tmux"
brew "vercel-cli"
brew "watch"
brew "wrk"
brew "yt-dlp"
brew "zoxide"
brew "zsh"
brew "anomalyco/tap/opencode"
brew "azure/functions/azure-functions-core-tools@4"
brew "oven-sh/bun/bun"
brew "planetscale/tap/pscale"
brew "supabase/tap/supabase"
brew "tursodatabase/tap/turso"

cask "1password"
cask "alt-tab"
cask "arc"
cask "caffeine"
cask "cap"
cask "chatgpt"
cask "codex"
cask "datagrip"
cask "dbngin"
cask "discord"
cask "docker-desktop"
cask "figma"
cask "firefox@developer-edition"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-geist"
cask "font-geist-mono"
cask "font-geist-mono-nerd-font"
cask "ghostty"
cask "google-chrome"
cask "imageoptim"
cask "jetbrains-toolbox"
cask "keycastr"
cask "lm-studio"
cask "loom"
cask "microsoft-azure-storage-explorer"
cask "microsoft-edge"
cask "microsoft-office"
cask "microsoft-teams"
cask "mullvad-vpn"
cask "notion"
cask "postman"
cask "raycast"
cask "rectangle"
cask "rider"
cask "shottr"
cask "signal"
cask "slack"
cask "spotify"
cask "stats"
cask "t3-code"
cask "the-unarchiver"
cask "visual-studio-code"
cask "webstorm"
cask "wireshark-app"
cask "zed"
cask "zoom"

mas "1Password for Safari", id: 1569813296
mas "Azure VPN Client", id: 1553936137
mas "Color Picker", id: 1545870783
mas "Developer", id: 640199958
mas "GarageBand", id: 682658836
mas "Gifski", id: 1351639930
mas "GSE SMART IPTV", id: 1293083751
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pure Paste", id: 1611378436
mas "Windows App", id: 1295203466
mas "Wipr", id: 1320666476
mas "Xcode", id: 497799835
