anthropic.claude-code
bierner.color-info
bradlc.vscode-tailwindcss
catppuccin.catppuccin-vsc
dbaeumer.vscode-eslint
docker.docker
eamodio.gitlens
esbenp.prettier-vscode
fey.oscura
formulahendry.auto-close-tag
formulahendry.auto-rename-tag
github.copilot-chat
ms-azuretools.vscode-azureappservice
ms-azuretools.vscode-azurefunctions
ms-azuretools.vscode-azureresourcegroups
ms-azuretools.vscode-azurestaticwebapps
ms-azuretools.vscode-azurestorage
ms-azuretools.vscode-bicep
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-dotnettools.csdevkit
ms-dotnettools.csharp
ms-dotnettools.vscode-dotnet-runtime
ms-vscode-remote.remote-containers
ms-vsliveshare.vsliveshare
mvllow.rose-pine
nize.oklch-preview
oxc.oxc-vscode
pkief.material-icon-theme
prisma.prisma
redhat.vscode-yaml
sanity-io.vscode-sanity
sdras.night-owl
streetsidesoftware.code-spell-checker
teabyii.ayu
unifiedjs.vscode-mdx
yoavbls.pretty-ts-errors
